In [3]:
import pandas as pd

### Pandas Version

In [10]:
pd.__version__

'2.2.2'

### Help

To get help we have to press "Shift+Tab" by pointing the mouse on the target element.

# SERIES (1D)

### Make a series from a list

In [19]:
lst1 = [1.2 , 2 , -3, 'indian']
print(lst1)
print("\n")

series1 = pd.Series(lst1)
print(series1)

[1.2, 2, -3, 'indian']


0       1.2
1         2
2        -3
3    indian
dtype: object

### Type checking

In [22]:
type(series1)

pandas.core.series.Series

### Empty series

In [25]:
empdf = pd.Series([])
print(empdf)

Series([], dtype: object)

### Create series

In [32]:
series2 = pd.Series([1,2,3,4,5])
print(series2)

0    1
1    2
2    3
3    4
4    5
dtype: int64

### Change Index values

In [35]:
series3 = pd.Series([1,2,3,4,5] , index = ['a','b','c','d','e'])
print(series3)

a    1
b    2
c    3
d    4
e    5
dtype: int64

### Change Index values as well as datatype

In [40]:
series4 = pd.Series([1,2,3,4,5] , index = ['a','b','c','d','e'],dtype = float)
print(series4)

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
dtype: float64

### Series of single element or scalar series

In [52]:
sclr_series = pd.Series(2)
print(sclr_series)

0    2
dtype: int64

### One element several number of times

In [54]:
sclr_series2 = pd.Series(2,index=[1,2,3,4,5])
print(sclr_series2)

1    2
2    2
3    2
4    2
5    2
dtype: int64

### Convert dictionary to series (also a case of modifying index values)

In [56]:
dic = {'a':1,'b':2,'c':3}
print(pd.Series(dic))

a    1
b    2
c    3
dtype: int64

### Access series element

In [62]:
print(series4[3])
print(series4[2:4]) #The starting address in inclusive and the end addrress is exclusive

4.0
c    3.0
d    4.0
dtype: float64

C:\Users\MSCLAB-148\AppData\Local\Temp\ipykernel_9756\1652587460.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(series4[3])

### Addition of two series

In [75]:
s5 = pd.Series([1,2,3,4,5])
s6 = pd.Series([1,2,3,4,5])

sum1 = s5+s6
print(sum1)

0     2
1     4
2     6
3     8
4    10
dtype: int64

In [68]:
sum2 = s5.add(s6)
print(sum2)

0     2
1     4
2     6
3     8
4    10
dtype: int64

### Min, Max

In [77]:
min(sum1)

2

In [79]:
max(sum1)

10

### find element with condition

In [84]:
sum1[sum1<8]

0    2
1    4
2    6
dtype: int64

### Delete element from a series

In [103]:
print("Original Series - \n",sum1)
print("\nAfter deleting 4 - \n",sum1.drop(4)) #The element in index 4 will be deleted

Original Series -
 0     2
1     4
2     6
3     8
4    10
dtype: int64

After deleting 4 -
 0    2
1    4
2    6
3    8
dtype: int64

### Absent Index value (NaN)

In [112]:
print(s6)
s7 = pd.Series([1,2,3])
print(s7)
print(s6+s7)

0    1
1    2
2    3
3    4
4    5
dtype: int64
0    1
1    2
2    3
dtype: int64
0    2.0
1    4.0
2    6.0
3    NaN
4    NaN
dtype: float64

# DATAFRAME (2D)

### Create an empty dataframe

In [151]:
empdf = pd.DataFrame([])
print(empdf)

Empty DataFrame
Columns: []
Index: []

### Convert list to Dataframe

In [132]:
lst2 = ['a','b','c']
print(lst2)
df1 = pd.DataFrame(lst2)
df1

['a', 'b', 'c']

   0
0  a
1  b
2  c

### Covert 2D List to Dataframe

In [130]:
ls_of_ls = [[1,2,3],[4,5,6],[7,8,9]]
print(ls_of_ls)

df2 = pd.DataFrame(ls_of_ls)
df2

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

### Covert Dictionary to Dataframe (it also modifies the column index)

In [143]:
dict1 = {'ID':[11,22,33,44]}
print(dict1)

df3 = pd.DataFrame(dict1)
df3

{'ID': [11, 22, 33, 44]}

   ID
0  11
1  22
2  33
3  44

In [149]:
dict2 = {'ID':[11,22,33,44],'SN':[1,2,3,4]}
print(dict2)

df4 = pd.DataFrame(dict2)
df4

{'ID': [11, 22, 33, 44], 'SN': [1, 2, 3, 4]}

   ID  SN
0  11   1
1  22   2
2  33   3
3  44   4

### Insufficient Data

In [154]:
ls_dict = [{'a':1,'b':2},{'a':3,'b':4,'c':5}]
df6 = pd.DataFrame(ls_dict)
df6

   a  b    c
0  1  2  NaN
1  3  4  5.0

### Fetch CSV Files

In [230]:
student_results = pd.read_csv("C:\\Users\\MSCLAB-148\\Desktop\\jupyter\\student_results.csv")
student_results
# We have to give two backslash otherwise it would not be recognised.

,Student ID,Class,Study hrs,Sleeping hrs,Social Media usage hrs,Mobile Games hrs,Percantege
0,1001,10,2,9,3,5,50
1,1002,10,6,8,2,0,80
2,1003,10,3,8,2,4,60
3,1004,11,0,10,1,5,45
4,1005,11,4,7,2,0,75
5,1006,11,10,7,0,0,96
6,1007,12,4,6,0,0,80
7,1008,12,10,6,2,0,90
8,1009,12,2,8,2,4,60
9,1010,12,6,9,1,0,85

### Take only the first 5 rows

In [193]:
student_results3 = pd.read_csv("C:\\Users\\MSCLAB-148\\Desktop\\jupyter\\student_results.csv",nrows = 5)
student_results3

,Student ID,Class,Study hrs,Sleeping hrs,Social Media usage hrs,Mobile Games hrs,Percantege
0,1001,10,2,9,3,5,50
1,1002,10,6,8,2,0,80
2,1003,10,3,8,2,4,60
3,1004,11,0,10,1,5,45
4,1005,11,4,7,2,0,75

### Take only specified columns

In [219]:
student_results2 = pd.read_csv("C:\\Users\\MSCLAB-148\\Desktop\\jupyter\\student_results.csv",usecols =  [0,1])
student_results2

   Student ID  Class
0        1001     10
1        1002     10
2        1003     10
3        1004     11
4        1005     11
5        1006     11
6        1007     12
7        1008     12
8        1009     12
9        1010     12

### Skip number of rows from the beginning

In [213]:
student_results1 = pd.read_csv("C:\\Users\\MSCLAB-148\\Desktop\\jupyter\\student_results.csv",skiprows =  2)
student_results1

   1002  10   6   8  2  0  80
0  1003  10   3   8  2  4  60
1  1004  11   0  10  1  5  45
2  1005  11   4   7  2  0  75
3  1006  11  10   7  0  0  96
4  1007  12   4   6  0  0  80
5  1008  12  10   6  2  0  90
6  1009  12   2   8  2  4  60
7  1010  12   6   9  1  0  85

### Type of dataframe

In [242]:
type(student_results)

pandas.core.frame.DataFrame

### Head (returns first 5 rows)

In [240]:
student_results.head()

,Student ID,Class,Study hrs,Sleeping hrs,Social Media usage hrs,Mobile Games hrs,Percantege
0,1001,10,2,9,3,5,50
1,1002,10,6,8,2,0,80
2,1003,10,3,8,2,4,60
3,1004,11,0,10,1,5,45
4,1005,11,4,7,2,0,75

### Tail (returns last 5 rows)

In [238]:
student_results.tail()

,Student ID,Class,Study hrs,Sleeping hrs,Social Media usage hrs,Mobile Games hrs,Percantege
5,1006,11,10,7,0,0,96
6,1007,12,4,6,0,0,80
7,1008,12,10,6,2,0,90
8,1009,12,2,8,2,4,60
9,1010,12,6,9,1,0,85

### Name of the columns

In [232]:
student_results.columns

Index(['Student ID', 'Class', 'Study hrs', 'Sleeping hrs',
       'Social Media usage hrs', 'Mobile Games hrs', 'Percantege'],
      dtype='object')

### Describe (Gives statistical parameters of each of the columns)

In [235]:
student_results.describe()

,Student ID,Class,Study hrs,Sleeping hrs,Social Media usage hrs,Mobile Games hrs,Percantege
count,10.00000,10.000000,10.000,10.000000,10.000000,10.000000,10.000000
mean,1005.50000,11.100000,4.700,7.800000,1.500000,1.800000,72.100000
std,3.02765,0.875595,3.335,1.316561,0.971825,2.347576,17.342626
min,1001.00000,10.000000,0.000,6.000000,0.000000,0.000000,45.000000
25%,1003.25000,10.250000,2.250,7.000000,1.000000,0.000000,60.000000
50%,1005.50000,11.000000,4.000,8.000000,2.000000,0.000000,77.500000
75%,1007.75000,12.000000,6.000,8.750000,2.000000,4.000000,83.750000
max,1010.00000,12.000000,10.000,10.000000,3.000000,5.000000,96.000000

### Info (Data about the data)

In [246]:
student_results.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 7 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Student ID              10 non-null     int64
 1   Class                   10 non-null     int64
 2   Study hrs               10 non-null     int64
 3   Sleeping hrs            10 non-null     int64
 4   Social Media usage hrs  10 non-null     int64
 5   Mobile Games hrs        10 non-null     int64
 6   Percantege              10 non-null     int64
dtypes: int64(7)
memory usage: 692.0 bytes

### Change the index column with an existing column of the dataframe

In [264]:
student_resultsid = pd.read_csv("C:\\Users\\MSCLAB-148\\Desktop\\jupyter\\student_results.csv",index_col =  'Student ID')
student_resultsid
# We can also use the index of the 'Student ID' column which is 0

,Class,Study hrs,Sleeping hrs,Social Media usage hrs,Mobile Games hrs,Percantege
Student ID,,,,,,
1001,10,2,9,3,5,50
1002,10,6,8,2,0,80
1003,10,3,8,2,4,60
1004,11,0,10,1,5,45
1005,11,4,7,2,0,75
1006,11,10,7,0,0,96
1007,12,4,6,0,0,80
1008,12,10,6,2,0,90
1009,12,2,8,2,4,60
1010,12,6,9,1,0,85

### Header

In [304]:
student_resultshd = pd.read_csv("C:\\Users\\MSCLAB-148\\Desktop\\jupyter\\student_results1.csv")
student_resultshd
# This dataframe has no headers

   1001  10   2   9  3  5  50
0  1002  10   6   8  2  0  80
1  1003  10   3   8  2  4  60
2  1004  11   0  10  1  5  45
3  1005  11   4   7  2  0  75
4  1006  11  10   7  0  0  96
5  1007  12   4   6  0  0  80
6  1008  12  10   6  2  0  90
7  1009  12   2   8  2  4  60
8  1010  12   6   9  1  0  85

In [306]:
student_resultshd = pd.read_csv("C:\\Users\\MSCLAB-148\\Desktop\\jupyter\\student_results1.csv",header=None)
student_resultshd
# We want to give it a header

      0   1   2   3  4  5   6
0  1001  10   2   9  3  5  50
1  1002  10   6   8  2  0  80
2  1003  10   3   8  2  4  60
3  1004  11   0  10  1  5  45
4  1005  11   4   7  2  0  75
5  1006  11  10   7  0  0  96
6  1007  12   4   6  0  0  80
7  1008  12  10   6  2  0  90
8  1009  12   2   8  2  4  60
9  1010  12   6   9  1  0  85

### Change column names

In [313]:
student_resultscl = pd.read_csv("C:\\Users\\MSCLAB-148\\Desktop\\jupyter\\student_results1.csv",names = ['Student ID', 'Class', 'Study hrs', 'Sleeping hrs',
       'Social Media usage hrs', 'Mobile Games hrs', 'Percantege'])
student_resultscl

,Student ID,Class,Study hrs,Sleeping hrs,Social Media usage hrs,Mobile Games hrs,Percantege
0,1001,10,2,9,3,5,50
1,1002,10,6,8,2,0,80
2,1003,10,3,8,2,4,60
3,1004,11,0,10,1,5,45
4,1005,11,4,7,2,0,75
5,1006,11,10,7,0,0,96
6,1007,12,4,6,0,0,80
7,1008,12,10,6,2,0,90
8,1009,12,2,8,2,4,60
9,1010,12,6,9,1,0,85

### LOC (returns any number of rows)

In [330]:
student_results.loc[0] #first row

Student ID                1001
Class                       10
Study hrs                    2
Sleeping hrs                 9
Social Media usage hrs       3
Mobile Games hrs             5
Percantege                  50
Name: 0, dtype: int64

In [333]:
student_results.loc[[0]] #first row in dataframe format

,Student ID,Class,Study hrs,Sleeping hrs,Social Media usage hrs,Mobile Games hrs,Percantege
0,1001,10,2,9,3,5,50

In [339]:
student_results.loc[[1,3]] #first and 3rd row

,Student ID,Class,Study hrs,Sleeping hrs,Social Media usage hrs,Mobile Games hrs,Percantege
1,1002,10,6,8,2,0,80
3,1004,11,0,10,1,5,45

In [341]:
student_results.loc[4,'Class'] #extract perticular column of particular row

11

In [343]:
student_results.loc[0:3,'Class'] #extract perticular column of particular rows

0    10
1    10
2    10
3    11
Name: Class, dtype: int64

In [351]:
student_results.loc[student_results['Class']<11,['Percantege']] #Get the percentages for all the classes < 11

   Percantege
0          50
1          80
2          60

### ILOC (Same as Loc but loc takes binary labels but it takes integer integer values)

In [364]:
student_results.iloc[:,0] #takes first column for all the rows

0    1001
1    1002
2    1003
3    1004
4    1005
5    1006
6    1007
7    1008
8    1009
9    1010
Name: Student ID, dtype: int64

In [372]:
student_results.iloc[[1,2],:] #first and second row for every columns

,Student ID,Class,Study hrs,Sleeping hrs,Social Media usage hrs,Mobile Games hrs,Percantege
1,1002,10,6,8,2,0,80
2,1003,10,3,8,2,4,60

In [376]:
student_results.iloc[:,[1,2]] #first and second column for every rows

   Class  Study hrs
0     10          2
1     10          6
2     10          3
3     11          0
4     11          4
5     11         10
6     12          4
7     12         10
8     12          2
9     12          6

# OS

### Get current working directory

In [202]:
import os
print(os.getcwd())

C:\Users\MSCLAB-148\Desktop\jupyter